OpenFOAM-3.0.0/cases/trembling2D/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            oscillatingDisplacement;
        amplitude	(0 0 1e-3);
        omega		1000; //T=1/2*pi*omega
        value    	uniform (0 0 0.0);
    }
    "(cyc1|cyc2)"
    {
        type            wedge;
    }
    free
    {
        type            uniformFixedValue;
        uniformValue    constant ( 0 0 0);
    }
}

// ************************************************************************* //
