OpenFOAM-3.0.0/cases/trembling2D/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    functionObjectLibs ("libsampling.so");
    outputControl   outputTime;

    surfaceFormat   vtk;
    fields          (p U rho);

    interpolationScheme cellPointFace;

    surfaces
    (
        x25
        {
            type            	sampledTriSurfaceMesh;
            surface		x25.stl;
            source		cells;
            interpolate     	true;
        }

        x50
        {
            type            	sampledTriSurfaceMesh;
            surface		x50.stl;
            source		cells;
            interpolate     	true;
        }

        // cylinder
        // {
        //     type            patch;
        //     patches         ("cyl");
        //     interpolate     false;
        // }
    );
}


// ************************************************************************* //
